Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Give me your blood, I will give you freedom.
hi: तुम मुझे खून दो, मैं तुम्हें आज़ादी दूंगा।

source: You give me blood, I will give you freedom.
hi: तुम मुझे खून दो, मैं तुम्हें आज़ादी दूंगा।

source: What color is your dress?
hi: कौनसे रंग का है तुम्हारा ड्रेस?

source: Tom's hair is wet.
hi: टॉम के बाल गीले हैं।

source: That voice sounds familiar.
hi: वह आवाज़ जाना पहचाना लगता है।

source: It's Tom's birthday tomorrow.
hi: कल टॉम का जन्मदिन है।

source: How was the movie?
hi: फ़िल्म कैसी थी?

source: I'm a lawyer.
hi: मैं वकील हूँ।

source: I didn't want to cry in front of him.
hi: मुझे उसके सामने नहीं रोना था।

source: I learn Kannada.
hi: मैं कन्नड़ सीखता हूँ।

source: Chiqui is a good parrot.
hi: चिकी अच्छा तोता है।

source: Chiqui is a parrot that speaks Esperanto.
hi: चिकी एक ऐसा तोता है जो एस्पेरांतो में बात करता है।

source: I want a parrot.
hi: मुझे एक तोता चाहिए।

source: This parrot has green feathers.
hi: इस तोते के हरे पर हैं।

source: Why is life so difficult?
hi: ज़िंदगी इतनी मुश्किल क्यों होती है?

source: Why is love so difficult?
hi: प्यार इतना मुश्किल क्यों होता है?

source: Kosovo is now an independent country.
hi: कोसोवो अब एक स्वतंत्र देश है।

source: Sean Connery is a Scottish actor.
hi: शॉन कॉनरी एक स्काटिश अभिनेता हैं।

source: I don't have time to talk.
hi: मुझे बात करने के लिये वक़्त नहीं है।

source: I have a date with him tonight.
hi: मेरी उसके साथ आज रात डेट है।

source: I have a date with Tom tonight.
hi: मेरी आज रात टॉम के साथ डेट है।

source: I have a date with her tonight.
hi: मेरी उसके साथ आज रात डेट है।

source: This screw is made in China.
hi: यह स्क्रू चीन में बना है।

source: This plastic squirrel was made in China.
hi: यह प्लास्टिक की गिलहरी चीन में बनी है।

source: She knows Spanish.
hi: उसे स्पेनिश आती है।

source: Salt is used to melt snow.
hi: नमक का उपयोग बर्फ पिघलाने में किया जाता है।

source: Almost all humans wear clothes.
hi: लगभग सभी इनसान कपड़े पहनते हैं।

source: He's learning Esperanto.
hi: वह एस्पेरांतो सीख रहा है।

source: I live in Malaysia.
hi: मैं मलेशिया में रहता हूँ।

source: Lava is dangerous.
hi: लावा खतरनाक होता है।

source: What did he say to you?
hi: उसने तुम से क्या कहाँ?

source: What did she say to you?
hi: उसने तुम से क्या कहाँ?

source: I'm from Germany.
hi: मैं जर्मनी से हूँ।

source: Hello?
hi: हैलो?

source: Are you guys all right?
hi: तुम लोग ठीक हो?

source: You're not stupid at all.
hi: तुम बिलकुल भी बेवकूफ नहीं हो।

source: How did you get caught?
hi: तुम पकड़े कैसे गये?

source: The sky is above the earth.
hi: धरती के ऊपर आकाश है।

source: Why did you marry him?
hi: तुम ने उससे शादी क्यों की?

source: Who is to blame?
hi: दोष किसका है?

source: This vampire works for a blood bank.
hi: यह पिशाच एक रक्त बैंक के लिये काम करता है।

source: This file is encrypted.
hi: यह फाइल एन्क्रिप्टेड है।

source: Tom looks like he's going to cry.
hi: टॉम को देख कर लग रहा है वह रोने वाला है।

source: Go there and talk to her.
hi: वहाँ जा कर उससे बात करो।

source: She taught her children Russian.
hi: उसने अपने बच्चों को रूसी सिखाई।

source: Tom plays the xylophone.
hi: टॉम सिलाफ़न बजाता है।

source: The sun will become a red giant in about 5 billion years.
hi: ५ अरब सालों में सूर्य एक लाल दानव तारा बन जाएगा।

source: The chief minister of Maharashtra is Devendra Fadnavis.
hi: महाराष्ट्र के मुख्य मंत्री देवेंद्र फडणवीस हैं।

source: Lakshadweep is a union territory of India.
hi: लक्षद्वीप भारत का एक केंद्र-शासित प्रदेश है।

source: The region called Azad Kashmir in Pakistan is called Pakistan-Occupied Kashmir in India.
hi: जिस प्रदेश को पाकिस्तान में आज़ाद कश्मीर कहाँ जाता है, उसे भारत में "पाकिस्तान व्याप्त कश्मीर" कहाँ जाता है।

source: Babur established the Mughal Empire.
hi: बाबर ने मुग़ल साम्राज्य की स्थापना की।

source: Babur, Humayun, Akbar, Jahangir, Shah Jahan and Aurangzeb are considered the most important Mughal emperors.
hi: बाबर, हुमायून, अकबर, जहाँगीर, शाह जहाँ और औरंगज़ेब सबसे महत्त्वपूर्ण मुग़ल सम्राट माने जाते हैं।

source: Konkani is spoken in Maharashtra, Goa and Karnataka.
hi: कोंकणी महाराष्ट्र, गोआ और करनाटक में बाली जाती है।

source: Shivaji founded the Maratha Empire, and his first Peshwa was Moropant Pingle.
hi: शिवाजी ने मराठा स्थापना की, और मोरोपंत पिंगळे उनके पहले पेशवा थे।

source: Babur's full name was Zahir-ud-din Muhammad Babur.
hi: बाबर का पूरा नाम ज़हीरुद्दीन मुहम्मद बाबर था।

source: Raigad was the first capital of the Maratha Empire.
hi: रायगढ़ मराठा साम्राज्य की पहली राजधानी थी।

source: Dengue is spread by Aedes aegypti mosquitoes.
hi: डेंग्यू एइडीज़ इजिप्टाई मच्छरों से फैलता है।

source: In 1996, the name of Victoria Terminus was changed to Chhatrapati Shivaji Terminus.
hi: १९९६ में विक्टोरिया टर्मिनस का नाम बदल कर छत्रपति शिवाजी टर्मिनस कर दिया गया।

source: The Sikh Empire was established in 1799 by Ranjit Singh.
hi: सिख साम्राज्य १७९९ में रणजीत सिंह ने स्थापित किया था।

source: The Indian National Congress and the Bharatiya Janata Party are the most prominent political parties in India.
hi: भारतीय राष्ट्रीय कांग्रेस और भारतीय जनता पार्टी भारत की सबसे प्रमुख राजनीतिक दल हैं।

source: Afghanistan, Bangladesh, Bhutan, India, Maldives, Nepal, Pakistan and Sri Lanka are the eight members of the South Asian Association for Regional Cooperation.
hi: अफगानिस्तान, बांग्लादेश, भूटान, भारत, मालदीव, नेपाल, पाकिस्तान और श्रीलंका दक्षिण एशियाई क्षेत्रीय सहयोग संगठन के आठ सदस्य हैं।

source: Aksai Chin is claimed by India, but controlled by China.
hi: अक्साई चिन पर भारत का दावा है, मगर वह चीन के नियंत्रण में है।

source: The official languages of the United Nations are Arabic, Chinese, English, French, Russian and Spanish.
hi: संयुक्त राष्ट्र की अधिकृत भाषाएँ अरबी, चीनी, अंग्रेज़ी, फ़्रांसीसी और रूसी हैं।

source: The Durrani Empire defeated the Marathas at the Third Battle of Panipat.
hi: दुर्रानी साम्राज्य ने पानीपत के तीसरी लड़ाई में मराठों को हराया।

source: The Durrani Empire was established in Afghanistan by Ahmad Shah Durrani in 1747.
hi: दुर्रानी साम्राज्य १७४७ में अफगानिस्तान में अहमद शाह दुर्रानी ने स्थापित किया था।

source: The residents of Mumbai are called Mumbaikars.
hi: मुम्बई के निवासियों को मुम्बईकर कहते हैं।

source: The Vedas were written in Sanskrit.
hi: वेद संस्कृत में लिखे गए थे।

source: In the Rig Veda, Agni is the god of fire.
hi: ऋगवेद में अग्नी आग का देवता है।

source: Hyderabad was ruled by a nizam until 1948.
hi: हैदराबाद पर १९४८ तक निज़ाम का राज था।

source: Many Hindus consider Sanskrit to be the language of the gods.
hi: कई हिंदू संस्कृत को देवताओं की भाषा समझते हैं।

source: It'll only take a minute.
hi: बस एक मिनट ही तो लगेगा।

source: I want a blanket.
hi: मुझे एक कंबल चाहिए।

source: The world population reached one billion for the first time in 1804.
hi: दुनिया की लोकसंख्या १८०४ में पहली बार एक अरब तक पहुँच गयी।

source: I'm older than you. You have to listen to me.
hi: मैं तुम से बड़ा हूँ। तुम्हें मेरी सुननी चाहिए।

source: Laika died when Sputnik 2 burned out in the atmosphere.
hi: स्पुट्निक २ वातावरण में जल जाने पर लाइका की मौत हो गयी।

source: Rosetta was built by the European Space Agency.
hi: रोज़ेटा यूरोपीय अंतरिक्ष एजेंसी ने बनाया था।

source: Rosetta will try to land on a comet in a few hours.
hi: रोज़ेटा कुछ ही घंटों में एक धूमकेतु पर लैंड करने की कोशिश करेगा।

source: What is the poorest country in the European Union?
hi: यूरोपीय संघ में सबसे गरीब देश कौन सा है?

source: We ate tilapia and rice.
hi: हमने टिलापिया और चावल खाया।

source: Some countries in Europe are not part of the European Union.
hi: यूरोप में स्थित कुछ देश यूरोपीय संघ में नहीं हैं।

source: Eat!
hi: खाओ!

source: Philae's landing site was named Agilkia.
hi: फिले के लैंडिंग स्थल का नाम आगिल्किआ रखा गया।

source: My dear friend!
hi: मेरे दिली दोस्त!

source: Contraception is cheaper than pregnancy.
hi: गर्भ-निरोध गर्भावस्था से सस्ता होता है।

source: Has anyone ever broken your heart?
hi: क्या किसी ने कभी तुम्हारा दिल तोड़ा है?

source: It was Tom who told Mary.
hi: मैरी को जिसने बताया वह टॉम था।

source: Only 5 million people live in Norway.
hi: नॉर्वे में बस ५० लाख लोग रहते हैं।

source: One of them is probably lying.
hi: उनमें से एक शायद झूठ बोल रहा है।

source: What's the matter, Mary? You can talk to me if you want.
hi: क्या बात है, मैरी? चाहो तो तुम मुझ से बात कर सकती हो।

source: I like spending time with you.
hi: मुझे तुम्हारे साथ वक़्त बिताना अच्छा लगता है।

source: I think Tom will win.
hi: मुझे लगता है टॉम जीतेगा।

source: Is that a real diamond?
hi: क्या वह एक असली हीरा है?

source: King Solomon was known for his wisdom.
hi: राजा सुलेमान अपनी बुद्धी के लिये जाने जाते थे।

source: King Suleiman was known for his wisdom.
hi: राजा सुलेमान अपनी बुद्धी के लिये जाने जाते थे।

source: Tom set down his beer.
hi: टॉम ने अपनी बीयर नीचे रख दी।

source: Tom tried putting on the coat.
hi: टॉम ने कोट पहन कर देखा।

source: It seems Tom is very sleepy.
hi: लगता है टॉम को बहुत नींद आई है।

source: It's a horse.
hi: घोड़ा है।

source: I'm also learning Amharic.
hi: मैं अम्हारी भी सीख रहा हूँ।

source: This is a paper ticket.
hi: यह कागज़ी टिकट है।

source: My name is James.
hi: मेरा नाम जेम्स है।

source: You have water.
hi: तुम्हारे पास पानी है।

source: Tatoeba is currently unavailable. We are sorry for the inconvenience. You can check our blog or Twitter for more information.
hi: तातोएबा इस वक़्त अनुपलब्ध है। असुविधा के लिए हमें खेद है। अधिक जानकारी के लिये आप हमारा ब्लॉग या ट्विटर देख सकते हैं।

source: Tatoeba.org is offline for maintenance.
hi: Tatoeba.org रखरखाव के लिये ऑफलाइन है।

source: Our website is offline for scheduled maintenance.
hi: हमारी वेबसाइट शेड्यूल किये गये रखरखाव के लिये ऑफलाइन है।

source: Our website is offline for scheduled maintenance. We expect to be back online by 2:30 GMT.
hi: हमारी वेबसाइट शेड्यूल किये गये रखरखाव के लिये ऑफलाइन है। २:३० जी.एम.टी. तक फिर ऑनलाइन होने की अपेक्षा है।

source: Is it a girl or a boy?
hi: लड़की है या लड़का?

source: Even the blackest cow only gives white milk.
hi: सबसे काली गाय भी सफ़ेद दूध ही देती।

source: He is not in the city.
hi: वह शहर में नहीं है।

source: Give me water.
hi: मुझे पानी दो।

source: We have pulao, lo mein and kebabs in our restaurant.
hi: हमारे रेस्तराँ में पुलाव, लो मेइन और कबाब हैं।

source: Not only did I eat pulao, but I also ate kebabs.
hi: मैंने पुलाव ही नहीं, बल्कि कबाब भी खाए।

source: There are islands in the sea.
hi: सागर में द्वीप हैं।

source: We are from Russia.
hi: हम रूस से हैं।

source: English is studied in most countries.
hi: अंग्रेज़ी की पढ़ाई ज़्यादातर देशों में की जाती है।

source: Your blood is red.
hi: तुम्हारा ख़ून लाल रंग का है।

source: How many apples were in the box?
hi: बक्से में कितने सेब थे?

source: It's a big responsibility.
hi: बड़ी ज़िम्मेदारी है।

source: I like playing chess.
hi: मुझे शतरंज खेलना अच्छा लगता है।

source: I'm trying to learn English.
hi: मैं अंग्रेजी सीखने का प्रयास कर रहा हूँ।

source: Tunisia is located in Africa.
hi: ट्यूनीशिया आफ़्रिका में स्थित है।

source: Asia is four times larger than Europe.
hi: एशिया युरोप से चार गुना बड़ा है।

source: This is a story of love and friendship.
hi: यह कहानी है प्यार और मित्रता की।

source: What is microeconomics?
hi: सूक्ष्मअर्थशास्त्र क्या होता है?

source: What is Rob like?
hi: रॉब कैसा है?

source: There he is!
hi: वह रहा!

source: It seems that he is fine.
hi: लगता है वह ठीक है।

source: What's the matter, Tom? Are you crying?
hi: टॉम, क्या हुआ? रो रहे हो?

source: Dad, what are you doing?
hi: पिताजी, आप क्या कर रहे हो?

source: I live in India.
hi: मैं भारत में रहता हूँ।

source: You are my good friend.
hi: तुम मेरे अच्छे दोस्त हो।

source: He has tea every morning.
hi: वह हर सुबह चाय पिता है।

source: "What do you want to know?" "Everything."
hi: "तुम क्या जानना चाहते हो?" "सब कुछ।"

source: He fled with the money.
hi: वह पैसा ले कर भाग गया।

source: Religion played an important role during the Middle Ages.
hi: मध्ययुग के दौरान धर्म ने एक अहम भूमिका निभाई।

source: What's the meaning of this sentence?
hi: इस वाक्य का मतलब क्या है?

source: It is soft.
hi: मुलायम है।

source: I am still eating.
hi: मैं अभी भी खा रहा हूँ।

source: Some believe that the Earth is a kind of hell.
hi: कोई मानते हैं के पृथ्वी एक प्रकार का नरक है।

source: There are fish in the sea.
hi: समुंदर में मछलियां होती हैं।

source: I have a horse.
hi: मेरे पास एक घोडा है।

source: Tom also smiled.
hi: टॉम भी मुस्कुराया।

source: Tom was going to shoot me.
hi: टॉम मुझे गोली मारने वाला था।

source: Tom cursed himself.
hi: टॉम ने अपने आप को गाली दी।

source: Tom heard nothing.
hi: टॉम को कुछ भी सुनाई नहीं दिया।

source: Tom was waiting.
hi: टॉम इंतज़ार कर रहा था।

source: We're not bad people, Tom.
hi: हम बुरे लोग नहीं हैं, टॉम।

source: This isn't your home, Tom.
hi: यह तुम्हारा घर नहीं है, टॉम।

source: It'll just take three minutes.
hi: बस तीन मिनट लगेंगे।

source: My sons are soldiers.
hi: मेरे बेटे सैनिक हैं।

source: The victory is yours.
hi: जीत तुम्हारी है।

source: Tom knew that.
hi: टॉम को वह पता था।

source: I told Tom my story.
hi: मैंने टॉम को मेरी कहानी बताई।

source: Where are your people?
hi: तुम्हारे लोग कहाँ है?

source: Why did you do this to me?
hi: तुमने मेरे साथ ऐसा क्यों किया?

source: What would Tom say if he were alive today?
hi: टॉम आज ज़िंदा होता तो वह क्या कहता?

source: Tom isn't a bit scared.
hi: टॉम ज़रा भी डरा हुआ नहीं है।

source: I got out my knife.
hi: मैंने मेरी छुरी निकाली।

source: That wasn't a lie.
hi: वह झूठ नहीं था।

source: There was no one there.
hi: वहाँ कोई नहीं था।

source: Get ready for a shock.
hi: झटके के लिए तैयार हो जाऐं।

source: My real name is Tom.
hi: मेरा असली नाम टॉम है।

source: They both laughed again.
hi: वे दोनों फिर से हसें।

source: Tom looked at his watch again.
hi: टॉम ने फिर से अपनी घड़ी की तरफ़ देखा।

source: I haven't seen Tom yet.
hi: मैंने अभी तक टॉम को नहीं देखा है।

source: This may come in handy.
hi: यह काम आ सकता है।

source: Tom and Mary were both sleepy.
hi: टॉम और मैरी दोनों को नींद आई थी।

source: This work isn't easy.
hi: यह काम आसान नहीं है।

source: Should I make some tea?
hi: थोड़ी सी चाय बनाऊं?

source: Why were you crying?
hi: तुम क्यों रो रहे थे?

source: Why did you marry Tom?
hi: तुमने टॉम से शादी क्यों की?

source: Was that guy Tom?
hi: वह बंदा टॉम था?

source: Did anyone else come into the room?
hi: कमरे में और कोई आया था क्या?

source: Is Tom a vegetarian?
hi: क्या टॉम शाकारी है?

source: Do you know that man?
hi: क्या तुम उस आदमी को जानते हो?

source: How did you feel then?
hi: तब आपको कैसा लगा?

source: What should I do until then?
hi: तब तक मुझे क्या करना चाहिए?

source: What do I do till then?
hi: तब तक मैं क्या करूं?

source: What'll you do then?
hi: फिर तुम क्या करोगे?

source: What will you say then?
hi: तब तुम क्या कहोगे?

source: Was the door open?
hi: दरवाज़ा खुला था क्या?

source: When do the shops open?
hi: दुकाने कब खुलती हैं?

source: Why don't you be quiet and listen?
hi: तुम चुपचाप सुनते क्यों नहीं?

source: Was his name Tom or John?
hi: उसका नाम टॉम था या जॉन?

source: Who let you come in?
hi: तुम्हें अंदर किसने आने दिया?

source: Did you forget that again?
hi: वह फिर से भूल गए क्या?

source: What's really going on?
hi: असल में चल क्या रहा है?

source: Are they really soldiers?
hi: क्या वे सच में सैनिक हैं?

source: What language was that?
hi: वह कौनसी भाषा थी?

source: How did you know Tom wasn't going to like it?
hi: आपको कैसे पता था टॉम उसको नापसंद करेगा?

source: Where do you think we should pitch our tent?
hi: आपके विचार में हमें अपना तम्बू कहाँ गाड़ना चाहिए?

source: Are you back from Japan?
hi: जापान से लौट आए?

source: There was a man who had three sons.
hi: एक आदमी था जिसके तीन बेटे थे।

source: Tom only has 5 hit points left.
hi: टॉम के पास बस ५ हिट पॉइंट बचे हैं।

source: Do you want tea or coffee?
hi: चाय चाहिए या कॉफ़ी?

source: India is my country.
hi: भारत मरा देश है।

source: What did you try to do?
hi: आपने क्या करने का प्रयत्न किया?

source: I often take a bath before breakfast.
hi: मैं अक्सर नाश्ते से पहले नहाता हूँ।

source: And if she is wrong?
hi: और यदि वह ग़लत हुई?

source: Mario, stop calling me gay! I'm straight!
hi: मारीओ, मुझे समलैंगिक कहना बंद करो! मैं सीधा हूँ!

source: I am extremely hungry.
hi: मुझे बड़े ज़ोरों की भूख लगी है।

source: You have three chances to spare.
hi: आप तीन मौके ले सकते हैं।

source: What is WhatsApp?
hi: वाट्सऐप क्या है?

source: Nothing is working.
hi: कुछ भी काम नहीं कर रहा।

source: What were you and Tom doing in the attic?
hi: तुम और टौम पडछत्ती पर क्या कर रहे थे?

source: If I want to go, I'll let you know.
hi: यदि मैने जाना हुआ तो आपको बता दूँगी।

source: If I'd wanted your opinion, I'd have asked for it.
hi: यदि मुझे आपकी राए चाहिए होती तो मैनें मांग लेनी थी।

source: Tom refused to admit it.
hi: टौम ने वह मानने से इंकार कर दिया।

source: May I have your email, please?
hi: क्या मैं आपका ई-मेल जान सकती हूँ?

source: Welcome to our first Italian class.
hi: हमारी पहली इतालवी क्लास में आपका स्वागत है।

source: I do not like you.
hi: मैं तुम्हें पसंद नहीं करती ।

source: Milk was sold in glass bottles.
hi: दूध कांच की बोतलों में बेचा गया।

source: Tell Tom that I'm still in a meeting.
hi: टौम को बता दें मैं अभी भी मीटिंग में हूँ।

source: Tom told everyone that he was adopted.
hi: टौम नें सबको बता दिया कि उसे गोद लिया गया था।

source: We love each other, but we don't have sex anymore.
hi: हम एक दूसरे से प्यार करते हैं, मगर अब हम सेक्स नहीं करते।

source: If I ever turn into an alcoholic, I'll surely go on vacation to Antalya.
hi: यदि मैं कभी शराब का आदी हुआ तो शर्तिया छुट्टी लेकर अंताल्या जाऊंगा।

source: This is not a secret.
hi: यह राज़ वाली बात नहीं है|

source: This isn't a secret.
hi: यह राज़ वाली बात नहीं है|

source: Now we are seven Arabs.
hi: अभी हम सात अरब हैं।

source: I approve his suggestion.
hi: मैं उसका सुझाव मंज़ूर करता हूँ|

source: Many soldiers were killed here.
hi: यहाँ कई सारे सैनिक मारे गये थे।

source: My son went to Iran.
hi: मेरा बेटा ईरान चला गया।

source: I was in Iran.
hi: मैं ईरान में था।

source: Not everyone was satisfied.
hi: हर कोई संतुष्ट न था।

source: Everyone was not happy.
hi: हर कोई ख़ुश नहीं था।

source: I like the company he keeps.
hi: मुझे उसकी सुगंध अच्छी लगती है।

source: I want you to utilize that object.
hi: मैं चाहती हूँ आप उसका प्रयोग करें।

source: Ignorance and error are as necessary to life as bread and water.
hi: अज्ञानता और ग़लती ज़िन्दगी में रोटी और पानी की तरह आवश्यक हैं।

source: You used to like coming here.
hi: आप यहाँ आना पसंद करते थे।

source: He's always laughing and having fun.
hi: वह हर समय हसीं-मज़ाक करता रहता है।

source: We are from Germany.
hi: हम जर्मनी से हैं।

source: The man drinks water.
hi: वह आदमी पानी पीता है |

source: What are you cooking today?
hi: आज आप क्या पका रहे हैं?

source: Since happiness doesn't exist, we have to strive to be happy without it.
hi: क्योंकि ख़ुशी का कोई अस्तित्व नहीं है, हमें उसके बिना खुश रहने का प्रयत्न करना चाहिए |

source: Tom's the last person I would've expected to have a heart attack.
hi: मैंने कभी न सोचा था कि टॉम को दिल का दौरा पड़ जाएगा |

source: I know that you don't want to talk to me.
hi: मुझे मालूम है आप मेरे साथ बात नहीं करना चाहते।

source: Tom works for a small company.
hi: टॉम एक छोटी कंपनी के लिए काम करता है |

source: The truth is, I don't have any problem with it.
hi: सच्ची बात तो यह है कि मुझे कोई परवाह नहीं।

source: Tom slowly retreated.
hi: टॉम धीरे-धीरे पीछे हटा |

source: Tom slowly drew back.
hi: टॉम धीरे-धीरे पीछे हटा |

source: Will you still be here when I get back?
hi: मेरे लौटने पर क्या तुम यहाँ होगे?

source: He watered the rose bush.
hi: उसने ग़ुलाब की झाड़ी को पानी दिया |

source: I am an astrologer.
hi: मैं ज्योत्षी हूँ |

source: I came here for you.
hi: मैं आपके लिए यहाँ आई थी |

source: The secret of longevity is to choose your parents carefully.
hi: धीर्ग आयु का राज़ अपने माता पिता का सतर्क चुनाव में है |

source: He is awake.
hi: वह जाग रहे हैं।

source: Tell my father that I've arrived.
hi: अपने पिता को मेरे आने का पैग़ाम दें।

source: A lot's happened while you've been away.
hi: आपकी अनुपस्तिथि में बहुत कुछ हो चुका है |

source: Men whose mothers had breast cancer run a higher risk of developing prostate cancer.
hi: जिन मर्दों की माताओं को छाती का कैंसर था उनको प्रोस्ट्रेट कैंसर होने का अधिक खदशा रहता है |

source: Women change the world.
hi: महिलाएँ दुनिया बदल देती हैं।

source: Tom has sex with Mary.
hi: टॉम मैरी के साथ सेक्स करता है।

source: Bob could not control his temper.
hi: बॉब अपना क्रोध काबू न कर पाया ।

source: This is my fiancé.
hi: यह मेरा मंगेतर है।

source: I've never had problems like yours.
hi: मुझे आपके जैसी अड़चने कभी नहीं आईं।

source: We're all with you.
hi: हम सब तुम्हारे साथ हैं।

source: Was Tom wrong?
hi: क्या टॉम गलत था?

source: This is our world.
hi: यह हमारी दुनिया है।

source: Why can't you understand?
hi: तुम समझ क्यों नहीं सकते?

source: I used to like Boston, too.
hi: मुझे भी बोस्टन पसंद था।

source: You were there, too.
hi: तुम भी वहाँ थे।

source: Here's your tea, Tom.
hi: यह रही तुम्हारी चाय, टॉम।

source: How can you say such a thing?
hi: तुम ऐसी चीज़ कह कैसे सकते हो?

source: It's a beautiful sword.
hi: खूबसूरत तलवार है।

source: They were just soldiers.
hi: वे तो बस सैनिक थे।

source: Where are my shoes?
hi: मेरे जूते कहाँ हैं?

source: Don't ever forget this rule.
hi: यह नियम कभी मत भूलना।

source: It's red.
hi: लाल है।

source: We'll meet again in October.
hi: हम अक्तूबर में फिर मिलेंगे।

source: I want my mom.
hi: मुझे मेरी माँ चाहिए।

source: I hope Tom helps me.
hi: उम्मीद है कि टॉम मुझे मदद करेंगे।

source: This man is harassing me.
hi: यह आदमी मुझे सता रहा है।

source: You seem lazy.
hi: तुम आलसी लगते हो।

source: This room is very large.
hi: यह कमरा बहुत बड़ा है।

source: Why are you standing here?
hi: तुम यहाँ क्यों खड़े हो?

source: You should come here.
hi: तुम्हें यहाँ आना चाहिए।

source: We're going to play a game.
hi: हम एक खेल खेलने वाले हैं।

source: I was there that day.
hi: उस दिन मैं वहाँ था।

source: This is a coconut.
hi: यह नारियल है।

source: Doing that won't solve anything.
hi: वैसा करने से कुछ नहीं सुलझने वाला.

source: Who are you, anyway?
hi: वैसे तुम हो कौन?

source: Just shut up and listen!
hi: बस चुप करो और सुनो!

source: The dog goes across the road.
hi: कुत्ता सड़क के पार जा रहा है।

source: What's the name of that bird?
hi: उस पंछी का नाम क्या है?

source: We eat.
hi: हम खाते हैं।

source: They eat.
hi: वे खाते हैं।

source: It may be difficult, but not impossible.
hi: मुश्किल होगा, मगर ना-मुमकिन नहीं।

source: My name is Rahul.
hi: मेरा नाम राहुल है।

source: Who bought you this?
hi: तुम्हे यह किसने दिलाया?

source: Does it taste good?
hi: क्या इसका स्वाद अच्छा है?

source: Water is life.
hi: जल ही जीवन है।

source: Let me sleep for another ten minutes.
hi: मुझे दस मिनिट और सोने दो|

source: It's impossible to fix.
hi: इसे ठीक करना नामुमकिन है|

source: I have two dogs, three cats, and six chickens.
hi: मेरे पास दो कुत्ते, तीन बिल्लियाँ और छः मुर्गियां हैं।

source: My real name is Mary.
hi: मेरा असली नाम मैरी है।

source: This is not our planet.
hi: यह हमारा ग्रह नहीं है।

source: This guy wants to be the boss.
hi: यह बंदा बॉस बनना चाहता है।

source: This boy never lies.
hi: यह लड़का कभी भी झूठ नहीं बोलता।

source: You poor thing.
hi: बेचारा।

source: I'm only doing my duty.
hi: मैं बस अपनी ड्यूटी कर रहा हूँ।

source: How many children are there?
hi: कितने बच्चे हैं?

source: She's been shot!
hi: उसे गोली लगी है!

source: I am not sure if I can do that but I will at least try.
hi: मुझे नहीं मालुम कि मैं वह कर सकती हूँ परंतु प्रयत्न तो करुँगी।

source: At our place, everybody's doing fine.
hi: हमारे यहाँ सब कुशल मंगल है।

source: We're from Germany.
hi: हम जर्मनी से हैं।

source: Both of us are from Germany.
hi: हम दोनों जर्मनी से हैं।

source: Here's your tea.
hi: यह रही आपकी चाय।

source: I was with him last night.
hi: मैं कल रात उसके साथ था।

source: I spoke with him today.
hi: मैंने आज उससे बात की।

source: I'm with him now.
hi: मैं अब उसके साथ हूँ।
